/***********************************************************************
方案说明：
***********************************************************************/
/**********************************************************************/
/*修改说明*/

/**********************************************************************/
/**********************************************************************/
/**********************************************************************/
/*头文件*/
#include <cms.h>
#include "main.h"
#include "delay.h"
#include "mytype.h"
#include "Touch_Kscan_Library.h"
#include "REL_Sender.h"
/**********************************************************************/
/*全局变量声明*/
/**********************************************************************/
volatile unsigned char tcount;
volatile bit buzf;
volatile unsigned int buzsec;

volatile unsigned char DispData;
/**********************************************************************/
/**********************************************************************/
/***********************************************************************
子函数功能：上电初始化系统寄存器
入口参数：
返回数据：
备注：
***********************************************************************/
void Init_ic (void)
{
	asm("clrwdt");
	PORTA = 0;
	PORTB = 0;
	INTCON = 0x00;
	PIR1 = 0;
	PIR2 = 0;
	WDTCON = 0x01;
	TRISA = 0B00000000;
	TRISB = 0B00000000;
	TRISC = 0x00;
	TRISD = 0x03;
	OPTION_REG = 0;
	OSCCON = 0x71;
	PIE1 = 0;
	PIE2 = 0;
	IOCB = 0;
	WPUA = 0;
	WPUB = 0;
}
/***********************************************************************
函数功能：初始上电RAM赋值
入口参数：
返回数据：
备注：
***********************************************************************/
void Init_ram (void)
{
	asm("clrwdt");
	PIE2 = 0;
	PIE1 = 0B00000010;
	PR2 = 125;				//8M下将TMR2设置为125us中断
	T2CON = 5;				//使能定时器2
	
	INTCON = 0XC0;			//使能中断
	buzf = 1;
	buzsec = 600;
}
/***********************************************************************
函数功能：系统寄存器刷新
入口参数：
返回数据：
备注：
***********************************************************************/
void Sys_set (void)
{
	asm("clrwdt");
	WDTCON = 0x01;
	TRISA = 0B00000000;
	TRISB = 0B00000000;
	TRISC = 0x00;
	TRISD = 0x00;
	OPTION_REG = 0;
	PIE1 = 0B00000010;
	PR2 = 125;
	INTCON = 0XC0;
	if(5 != T2CON)
		T2CON = 5;
	//WPUB = 0B01010010;
	//WPUA = 0B10000000;
}

/***********************************************************************
//键处理函数
***********************************************************************/
void Kscan()
{
	static unsigned int KeyOldFlag = 0,KeyREFFlag = 0;
	unsigned int i = (unsigned int)((KeyFlag[1]<<8) | KeyFlag[0]);

	if(i)
	{
		if(i != KeyOldFlag)
		{
			KeyOldFlag = i;			//有检测到按键

			buzf = 1;
			buzsec = 600;
			if(KeyOldFlag & 0x01)
			{
				if(0 == (KeyREFFlag & 0x01))
				{
					KeyREFFlag |= 0x01;
					DispData ^= 0x01;
				}
			}
			else
			{
				KeyREFFlag &= ~0x01;
			}
			
			if(KeyOldFlag & 0x02)
			{
				if(0 == (KeyREFFlag & 0x02))
				{
					KeyREFFlag |= 0x02;
					DispData ^= 0x02;
				}
			}
			else
			{
				KeyREFFlag &= ~0x02;
			}
			
			if(KeyOldFlag & 0x04)
			{
				if(0 == (KeyREFFlag & 0x04))
				{
					KeyREFFlag |= 0x04;
					DispData ^= 0x04;
				}
			}
			else
			{
				KeyREFFlag &= ~0x04;
			}
		
			if(KeyOldFlag & 0x08)
			{
				if(0 == (KeyREFFlag & 0x08))
				{
					KeyREFFlag |= 0x08;
					DispData ^= 0x08;
				}
			}
			else
			{
				KeyREFFlag &= ~0x08;
			}
		}
	}
	else
	{
		KeyOldFlag = 0;
		KeyREFFlag = 0;
	}
}

/***********************************************
函数名称：Display
函数功能：显示程序
入口参数：无
出口参数：无
备注：
************************************************/
void Display()//循环扫描各个COM口
{
	//Com = 1;
	Led1 = 0;
	Led2 = 0;
	Led3 = 0;
	Led4 = 0;
	
	if(DispData & 0x01) //TouchKey 2 RA1
		Led4 = 1;	//Led1 = 1;
	if(DispData & 0x02) //TouchKey 1  RA2
		Led2 = 1;
	if(DispData & 0x04)//TouchKey 0 RA0  
		Led3 = 1;
	
	
	
		
//	Com = 0;
	
	SEGEN0 = 0X80;
	SEGEN1 = 0X07;
	SEGEN2 = 0X20;
}
/***********************************************************************
函数功能：中断入口函数
***********************************************************************/
void interrupt time0(void)
{
	if(TMR2IF)
	{
		TMR2IF = 0;
		tcount ++;
		__CMS_GetTouchKeyValue();
	}
	else
	{
		PIR1 = 0;
		PIR2 = 0;
	}
}

/***********************************************************************
main主函数
***********************************************************************/
void main(void)
{
	/******************************************************************/
	asm("clrwdt");
	Init_ic();
	Delay_nms(200);													//上电延时200ms
	Init_ram();														//上电给初值
	
	while(1)
	{
		OSCCON = 0x71;
		if(tcount >= 32)
		{
			tcount = 0;												//主程序循环4ms
			Sys_set();
			Display();
			#if (REL_SENDER_ENABLE == 1)//调试宏定义是否为1
				REL_SenderLoop();//发码子程序
			#endif
			__CMS_CheckTouchKey();	//扫描按键
			Kscan();			//按键处理
		}
	}
}
/**********************************************************************/



